package com.example.balotcalculator;

import androidx.annotation.NonNull;
import androidx.appcompat.app.AppCompatActivity;
import androidx.appcompat.widget.Toolbar;

import android.os.Bundle;
import android.view.MenuItem;
import android.widget.TextView;
import android.widget.Toast;

public class MainActivity2 extends AppCompatActivity {

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main2);

        Toolbar toolbar = findViewById(R.id.scendtoolbar);
        setSupportActionBar(toolbar);
        getSupportActionBar().setDisplayHomeAsUpEnabled(true);

        TextView introduction = (TextView) findViewById(R.id.textView6);

        StringBuilder stringBuilder = new StringBuilder();
        String content = "مــقـــدمـــة:\n" +
                "في 15 فبراير أعلن خبر تنظيم أول بطولة للعبة (البلوت) على كأس الهيئة العامة للرياضة بجوائز مالية قدرها مليون ريال للفائزين.\n" +
                "يعتقد أن تسمية اللعبة مستوحاة من اسم رجل فرنسي (بيلوت) وهو من وضع قوانين اللعبة، ويقال إن اسم اللعبة جاء من كلمة (Plot )باإلنجليزية، والتي تعني\n" +
                "خطة أو حنكة.\n" +
                "\n" +
                "عن اللعبة:\n" +
                "البلوت هي لعبة حظ في المقام الأول، يلعبها أربعة أشخاص من خالل 32 ورقة، وكل شخصين متقابلين يشكلان فريقان.\n" +
                "تنتهي اللعبة بالوصول إلى رقم: 152 ،ويكون اللعب أما حكم أو صن.\n" +
                "\n" +
                "ورق اللعب:\n" +
                "ينقسم ورق اللعب إلى لونين:\n" +
                "1 الأحمر: الهاص (اللال)، الديمن (الشوكة).\n" +
                "2 الأسود: السبيت (الكالة)، الشرية.\n" +
                "\n" +
                "عدد ورق اللعب:\n" +
                "32 ورقة، مقسمة على 8 ورقات من كل نوع.\n" +
                "الاكه، الشايب، البنت، الولد، العشرة، التسعة، الثمانية، السبعة.\n" +
                "ترتيب الورق في المشاريع:\n" +
                "كل ثالث ورقات متتالية سرا.\n" +
                "أربع ورقات متتالية 50.\n" +
                "خمس ورقات متتالية 100.\n" +
                "كل أربع ورقات من النوع نفسه 100( ماعدا السبعة والثمانية والتسعة)\n" +
                "لأربع اكك 400 في الصن و100 في الحكم\n" +
                "\n" +
                "قوانين اللعب:\n" +
                "• الصن: هو اللعب من خالل ترتيب الورق على أساس: الاكه، العشرة، الشايب، البنت، الولد، التسعة، الثمانية، السبعة.\n" +
                "• الحكم: الولد، التسعة، الاكه، العشرة، الشايب، البنت، الثمانية، السبعة. تنتقل (الولد، التسعة) وتكون في المقدمة لنفس لون الحكم فقط.\n" +
                "\n" +
                "كيفية اللعب:\n" +
                "مجموعة من دورات اللعب، في كل دورة يحدث التالي:\n" +
                "1 التوزيع يكون في كل مرة على أحد اللاعبين، ويكون عكس عقارب الساعة.\n" +
                "2 التوزيع يكون ثالث ورقات في اللفة الأولى، و ورقتين في اللفة الثانية.\n" +
                "3 يضع الموزع ورقة في الميدان مكشوفة، ويقول: الأول.\n" +
                "4 يكون عند كل لاعب حق الإختيار بين: حكم، صن، أو (بس) بمعنى عدم الرغبة في شراء اللعبة.\n" +
                "5 بعد أن يقرر أحد اللاعبين، يكتمل توزيع الورق بعدد ثالث ورقات لكل شخص، أما المشتري فيحصل على ورقتين إضافة للورقة التي كانت في الميدان.\n" +
                "6 تكون بداية اللعب من عند الشخص الذي يجلس عن يمين موزع الورق.\n" +
                "7 في الدورة الأولى يعلن كل شخص عن مشاريعه.\n" +
                "8 اللاعب الذي تكون له الأكلة يستمر في اللعب، ويرفع الورق اللاعب المقابل (الخوي).\n" +
                "\n" +
                "احتساب النقاط:\n" +
                "• الاكه: 11 نقطة.\n" +
                "• العشرة: 10 نقاط.\n" +
                "• الشايب: 4 نقاط.\n" +
                "• البنت: 4 نقاط.\n" +
                "• الولد: نقطتان. ويحتسب بـ20 نقطة في حال الحكم فقط.\n" +
                "• التسعة: 14 نقطة في حال الحكم فقط، وتحديدا للنوع الذي اختير كحكم. بقية الأوراق لا تحتسب.\n" +
                "\n" +
                "التسجيل:\n" +
                "• يكون في الحكم اللعب على 16 نقطة، تضاف نقطتان للسرا، نقطتان للبلوت، خمس نقاط للخمسين، 10 نقاط للمية.\n" +
                "• يكون في الصن اللعب على 26 نقطة، تضاف 4 نقاط للسرا، 10 نقاط للخمسين، 20 نقطة للمية، 40 نقطة للـ400.\n" +
                "• النشرة تعلن بعد تسجيل كل جولة، ويكون اللعب من صفر إلى 152 ،وفي حال الرغبة في تقليص الوقت يمكن اللعب من عند النقطة 52 ،وتسمى (الفرشة).\n" +
                "\n" +
                "مزايا وقوانين وأسرار:\n" +
                "الديمقراطية:\n" +
                "اللعبة لا يوجد فيها حكم، من يلعبون هم الحكام أيضا.\n" +
                "\n" +
                "الرصة:\n" +
                "هي طريقة في ترتيب الورق من أجل الحصول على مشاريع، وتعد من ضمن الحيل المسموحة.\n" +
                "\n" +
                "التهريب:\n" +
                "هو طريقة رمي الورق غير المرغوب فيه، ويمكن أن يفهم (الخوي) ما يريده زميله، ويكتشف ورق الخصم من خلال التركيز على تهريبه أيضا.\n" +
                "\n" +
                "الإشارة:\n" +
                "من خوارم المروءة في اللعبة إرسال أي إشارة أو تقديم أي تلميح لفظي أو حركي (للخوي)، ويحق للفريق الخصم المطالبة بتسجيل قيد.\n" +
                "\n" +
                "القطع:\n" +
                "لعب ورقة لا تتوافق مع المنشور في الميدان مع وجود ورقة مماثلة، وهي مراوغة خطيرة اكتشافها يسمح للفريق الخصم بتسجيل قيد.\n" +
                "\n" +
                "الدبل:\n" +
                "خيار متاح لقلب طاولة اللعب على الشخص المشتري، وتتضاعف فيها نقاط الجولة، ويسمح فيها بالدبل، والثري، والفور، والقهوة (بمعنى تحسم اللعبة بالكامل\n" +
                "بنتيجة هذه الجولة).\n" +
                "\n" +
                "الحصانة:\n" +
                "في الحكم يجب على اللاعب حتى يسمح (للخوي) بالمقاطعة أن يقول: أكة.\n" +
                "\n" +
                "اللغة الشاعرية في البلوت:\n" +
                "- حكم: حكيم ومعارضك غشيم، تحكم وتظلم.\n" +
                "- صن: فن.\n" +
                "- أشكل: تمشكل.\n" +
                "- سرا: نعم الطرا\n" +
                "- خمسين: تعيش سنين، يا الصوت الحسين.\n" +
                "- مية: تعيش ليه.\n" +
                "- بلوت: ما تموت.\n" +
                "- ورق: احترق.\n" +
                "\n" +
                "المصدر:\n" +
                "https://makkahnewspaper.com/article/820317/" +
                "\n" +
                "\n" +
                "\n";

        stringBuilder.append(content);
        introduction.setText(stringBuilder.toString());

    }
    // It is not necessary and does not affect the work
    // It is there to remind me that it can be used
    @Override
    public boolean onOptionsItemSelected(@NonNull MenuItem item) {
        switch (item.getItemId()){  // for testing
            case R.id.home:
                Toast.makeText(this,"sultan3", Toast.LENGTH_SHORT).show();
                return true;
            default:
                return super.onOptionsItemSelected(item);
        }
    }

}

